benchmark/report/rps/full/20260804_150938/raw/001_health_c1_r1.txt
Running 20s test @ http://127.0.0.1:32776/api/health
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   374.84us  157.95us   4.34ms   90.03%
    Req/Sec     2.65k   321.72     3.93k    78.50%
  Latency Distribution
     50%  346.00us
     75%  399.00us
     90%  488.00us
     99%    0.98ms
  52760 requests in 20.00s, 23.60MB read
Requests/sec:   2637.69
Transfer/sec:      1.18MB
HPS_WRK_REQUESTS 52760
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 52760
HPS_STATUS_2XX 52760
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 200=52760